"""
该文件用于 python 脚本的 CRUD 操作
"""
import os
import sys
import django


pathname = os.path.dirname(os.path.abspath(__file__))
sys.path.insert(0, pathname)
sys.path.insert(0, os.path.abspath(os.path.join(pathname, '..')))
os.environ.setdefault("DJANGO_SETTINGS_MODULE", "albatross.settings")

django.setup()

from recruit.models import PostTree

data = {
    "创意/设计": {
        "美工设计": [
            "设计",
            "美工"
        ],
        "美化": [
            "图片处理",
            "摄影师",
            "精修美工"
        ],
        "互联网设计": [
            "交互设计",
            "网页设计制作",
            "UI设计"
        ]
    },
    "产品": {
        "产品": [
            "产品研发",
            "产品规划",
            "电商产品设计"
        ]
    },
    "物流/仓储": {
        "物流": [
            "报关员",
            "单证员",
            "海关事务管理"
        ],
        "仓储": [
            "仓储规划",
            "仓储管理",
            "海外仓"
        ]
    },
    "采购/供应链": {
        "采购": [
            "采购",
            "供应商开发",
            "质检",
            "测评专员"
        ],
        "供应链": [
            "供应链管理",
            "流程管理",
            "订单处理员"
        ]
    },
    "文员": {
        "秘书/文员/助理": [
            "文案编辑",
            "前台/总机/接待",
            "电脑操作/打字/录入员"
        ]
    },
    "技术研发": {
        "前端开发": [
            "前端开发"
        ],
        "后端开发": [
            "后端开发"
        ],
        "移动开发": [
            "移动开发"
        ]
    },
    "销售/客服": {
        "客服": [
            "客服",
            "申诉专员"
        ],
        "常规销售": [
            "常规销售",
            "网络销售",
            "电话销售",
            "卖家支持",
            "销售支持"
        ],
        "销售管理": [
            "区域销售",
            "大客户销售",
            "渠道销售",
            "中小企业直销"
        ]
    },
    "运营": {
        "品类运营": [],
        "独立站": [
            "独立站运营",
            "独立站负责人",
            "独立站合伙人"
        ],
        "高端运营": [
            "精品运营",
            "品牌运营"
        ],
        "跨境电商运营": [
            "运营",
            "直播运营",
            "用户运营",
            "数据运营",
            "内容运营",
            "商品运营",
            "活动运营",
            "海外运营",
            "搜索推荐运营"
        ]
    },
    "品牌/推广": {
        "推广": [
            "营销推广",
            "渠道推广",
            "海外推广",
            "招商",
            "活动策划",
            "测评推广"
        ],
        "广告": [
            "广告投放",
            "广告优化",
            "广告业务拓展"
        ],
        "品牌": [
            "品牌策划",
            "品牌公关",
            "品牌推广"
        ]
    },
    "市场/分析": {
        "市场": [
            "市场调研",
            "竞品分析",
            "用户研究",
            "策略发展"
        ],
        "行业分析": [
            "行业分析师",
            "业务分析师"
        ],
        "数据分析": [
            "数据分析",
            "数据合规分析",
            "搜索推荐分析"
        ]
    },
    "人事/财务/法务": {
        "人事": [
            "人力资源",
            "监察",
            "课程设计",
            "培训"
        ],
        "财务": [
            "财务",
            "成本管理",
            "销售管理",
            "审计",
            "出纳",
            "税务",
            "核销员"
        ],
        "法务": [
            "法务",
            "风控"
        ]
    }
}

for key_1 in data:
    node_1 = PostTree(
        name=key_1
    )
    node_1.save()
    for key_2 in data[key_1]:
        node_2 = PostTree(
            name=key_2,
            father=node_1
        )
        node_2.save()
        for key_3 in data[key_1][key_2]:
            node_3 = PostTree(
                name=key_3,
                father=node_2
            )
            node_3.save()

